app/Controllers/AuthController.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `username` = ''
SELECT *
FROM `user`
WHERE `username` = ''
---
    public function auth()
    {
        $username = trim((string) $this->request->getPost('username'));
        $password = (string) $this->request->getPost('password');

        // DEBUG: log username, db name, and direct count from table
        try {
            $db = db_connect();
            $dbName = method_exists($db, 'getDatabase') ? $db->getDatabase() : 'unknown';
            $directCount = $db->table('user')->where('username', $username)->countAllResults();
            log_message('info', 'AUTH DEBUG username="{username}", db="{db}", directCount={count}', [
                'username' => $username,
                'db' => $dbName,
                'count' => $directCount,
            ]);
        } catch (\Throwable $e) {
            log_message('error', 'AUTH DEBUG failed: {msg}', ['msg' => $e->getMessage()]);
        }

        $user = $this->userModel->getUserByUsernameAndRole($username);
        $foundViaModel = $user ? 'yes' : 'no';
        log_message('info', 'AUTH DEBUG userModel_found=' . $foundViaModel);
        @file_put_contents(WRITEPATH . 'logs/auth-debug.txt', date('c') . " userModel_found=" . $foundViaModel . "\n", FILE_APPEND);

        // Fallback: ambil langsung dari tabel user jika model tidak menemukan (hindari dampak JOIN)
        if (!$user) {
            try {
                $db = db_connect();
                $direct = $db->table('user')->where('username', $username)->get()->getRowArray();