app/Controllers/DashboardController.php

    public function index()
    {
        if (!$this->session->get('logged_in')) {
            return redirect()->to('/')
                ->with('error', 'Silakan login terlebih dahulu');
        }

        $role = (int) $this->session->get('role');
        $rtId = $this->session->get('rt_id');

        // Builder penduduk tetap
        $tetap = $this->pendudukModel;
        if ($role === 2 && $rtId) {
            $tetap = $tetap->where('rt_id', $rtId);
        }

        // Builder musiman
        $musiman = $this->musimanModel;
        if ($role === 2 && $rtId) {
            $musiman = $musiman->where('rt_id', $rtId);
        }

        // Window waktu untuk perbandingan 30 hari
        $cutoff   = date('Y-m-d H:i:s', strtotime('-30 days'));
        $prevStart = date('Y-m-d H:i:s', strtotime('-60 days'));
        $prevEnd   = $cutoff;

        // Total Tetap dan baseline 30 hari lalu
        $totalTetap = (clone $tetap)->countAllResults(false);
        $totalTetapBefore = (clone $tetap)->where('created_at <', $cutoff)->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
SELECT COUNT(*) AS `numrows`
FROM `penduduk`
WHERE `created_at` < '2025-08-19 07:16:30'