app/Models/UserModel.php

    public function updatePassword($userId, $newPassword)
    {
        return $this->update($userId, [
            'password' => password_hash($newPassword, PASSWORD_DEFAULT)
        ]);
---
UPDATE `user` SET `password` = '$2y$10$cu3V6ws/k9iDd3kdndXiJOEpFtBSWGdfd6Jtqgm6gU714r6AK1XSO', `updated_at` = '2025-09-18 07:16:28'
WHERE `user`.`id` IN ('122')