app/Models/UserModel.php

    public function getUserByUsernameAndRole(string $username)
    {
        $builder = $this->db->table('user u')
            ->where('u.username', $username);

        $builder->select('u.id as user_id, u.username, u.password, u.role, u.email, u.role_id, u.rt_id, u.is_active, d.nama as wilayah_nama, d.id as desa_id, d.kecamatan_id')
            ->join('desa d', 'd.id = u.role_id', 'left');

        return $builder->get()->getRowArray();
---
SELECT `u`.`id` as `user_id`, `u`.`username`, `u`.`password`, `u`.`role`, `u`.`email`, `u`.`role_id`, `u`.`rt_id`, `u`.`is_active`, `d`.`nama` as `wilayah_nama`, `d`.`id` as `desa_id`, `d`.`kecamatan_id`
FROM `user` `u`
LEFT JOIN `desa` `d` ON `d`.`id` = `u`.`role_id`
WHERE `u`.`username` = ''